---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyleOverrideOptions.BorderTopLineStyle
source: html/80d0b613-3897-a319-ddc6-36ca077cd323.htm
---
# Autodesk.Revit.DB.TableCellStyleOverrideOptions.BorderTopLineStyle Property

Indicates if the border top line style characteristic is overridden.

## Syntax (C#)
```csharp
public bool BorderTopLineStyle { get; set; }
```